In [72]:
import pandas as pd
import numpy as np

In [73]:
stock_price_DF_withIndex = pd.DataFrame(
    [10000, 10300, 9900, 10500, 11000],
    index = ["2016-03-01","2016-06-01","2016-09-01","2016-12-01","2017-03-01"])
stock_price_DF_withIndex

                0
2016-03-01  10000
2016-06-01  10300
2016-09-01   9900
2016-12-01  10500
2017-03-01  11000

In [74]:
# "0"을 "시가"로 컬럼명을 바꿔주세요.
# 0은 숫자로 되어있음. 주의해야함
stock_price_DF_withIndex.rename(columns = {0: "시가"}, inplace=True)


# column 추가(기존에 DF 데이터가 존재할 때 컬럼을 추가하는 경우) - 비어있는 DF인 경우에 컬럼추가하는 접근방법이 달라짐
tmp = [11000,12000,10000,13000,12000]
stock_price_DF_withIndex["종가"] = tmp
tmp = [13000,15000,15000, 18000, 17000]
stock_price_DF_withIndex["고가"] = tmp
tmp = [3000,5000,5000,8000,7000]
stock_price_DF_withIndex["저가"] = tmp

stock_price_DF_withIndex

               시가     종가     고가    저가
2016-03-01  10000  11000  13000  3000
2016-06-01  10300  12000  15000  5000
2016-09-01   9900  10000  15000  5000
2016-12-01  10500  13000  18000  8000
2017-03-01  11000  12000  17000  7000

### 요일별로 최고값과 최저값을 찾아서 그 차이를 계산해보자

In [75]:
# 첫번째 줄 부터 행 단위로 움직임
# sort_index에서의 axis와 조금 다르다.
print(stock_price_DF_withIndex.apply(lambda x : x.max() - x.min())) # 열 단위로 max값과 min값의 차이를 출력
print()
print(stock_price_DF_withIndex.apply(lambda x : x.max() - x.min(), axis = 1)) # 행 단위로 기준
print()

시가    1100
종가    3000
고가    5000
저가    5000
dtype: int64

2016-03-01    10000
2016-06-01    10000
2016-09-01    10000
2016-12-01    10000
2017-03-01    10000
dtype: int64

In [76]:
stock_price_DF_withIndex["Gap"] = stock_price_DF_withIndex.apply(lambda x : x.max() - x.min(), axis = 1)
stock_price_DF_withIndex

               시가     종가     고가    저가    Gap
2016-03-01  10000  11000  13000  3000  10000
2016-06-01  10300  12000  15000  5000  10000
2016-09-01   9900  10000  15000  5000  10000
2016-12-01  10500  13000  18000  8000  10000
2017-03-01  11000  12000  17000  7000  10000

In [70]:
# loc를 이용한 방법
# 할당을 해야 한다. 그래야 gap_forloop 칼럼이 생성
# 칼럼이나 행을 추가할 때 크기에 맞지않게 집어넣어야 새로운 칼럼(행) 추가됨
stock_price_DF_withIndex["gap_forloop"] = 0
for i in stock_price_DF_withIndex.index:
    maxV = stock_price_DF_withIndex.loc[i].max()
    minV = stock_price_DF_withIndex.loc[i, "시가":"저가"].min()
    stock_price_DF_withIndex.loc[i, "gap_forloop"] = maxV - minV

stock_price_DF_withIndex

               시가     종가     고가    저가    Gap  gap_forloop
2016-03-01  10000  11000  13000  3000  10000        10000
2016-06-01  10300  12000  15000  5000  10000        10000
2016-09-01   9900  10000  15000  5000  10000        10000
2016-12-01  10500  13000  18000  8000  10000        10000
2017-03-01  11000  12000  17000  7000  10000        10000

#### get_loc("해당 칼럼") 해당 칼럼명이 위치한 위치값 (0 부터)

In [117]:
# iloc 이용한 방법
stock_price_DF_withIndex["Gap_forloop"] = 0
labels = ["Gap_forloop"]
stock_price_DF_withIndex.loc[,"시가","종가"]
# Gap_forloop 칼럼이 몇번째 위치인지 알아내기 위한 방법
# get_loc("해당 칼럼") 해당 칼럼명이 위치한 위치값 (0 부터)
index_ints = [stock_price_DF_withIndex.columns.get_loc(label) for label in labels]
index_ints

for i in range(0, len(stock_price_DF_withIndex)):
    tempValue = stock_price_DF_withIndex.iloc[i, 0:4]
    tempMax = tempValue.max()
    tempMin = tempValue.min()
    stock_price_DF_withIndex.iloc[i, index_ints[0]] = tempMax - tempMin
    
stock_price_DF_withIndex

IndexingError: Too many indexers

#### 위의 데이터에서 시가, 종가 ,고가, 저가의 전체 평균을 구하세요

In [86]:
# stock_price_DF_withIndex.loc[:, "시가":"저가"]
stock_price_DF_withIndex[["시가","종가","고가","저가"]].apply(lambda x : np.mean(x), axis = 0)

시가    10340.0
종가    11600.0
고가    15600.0
저가     5600.0
dtype: float64

In [87]:
stock_price_DF_withIndex[["시가","종가","고가","저가"]].apply(lambda x : np.mean(x), axis = 1)

2016-03-01     9250.0
2016-06-01    10575.0
2016-09-01     9975.0
2016-12-01    12375.0
2017-03-01    11750.0
dtype: float64

### Data cleaning

### dropna() : 하나라도 NaN이 존재시 행 자체를 제거

In [94]:
from numpy import nan as NA
import pandas as pd

data = pd.DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA, 6.5,3]])
cleanded =data.dropna()

In [92]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [93]:
# 행(데이터)의 여러 개의 요소들 중 하나라도 NaN이 존재하면 아예 없애버린다.
cleanded

     0    1    2
0  1.0  6.5  3.0

#### dropna(axis로 조절) : axis = 0 (행 기준, default) / 1 (열 기준)

In [99]:
# 칼럼 기준으로 NaN 하나라도 존재시 전체 칼럼을 삭제
cleanded_fix = data.dropna(axis = 1) 
cleanded_fix

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

#### dropna(how="all") : 전체가 NaN인 경우

In [100]:
# how="all" : 전체 데이터가 NaN인 경우에만 삭제
# 행기준으로
data.dropna(how="all", axis = 0)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [101]:
# 열기준으로
data.dropna(how="all", axis = 1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [103]:
from numpy import nan as NA
df = pd.DataFrame(np.random.randn(7,3))

df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0  1.565406       NaN       NaN
1 -0.780808       NaN       NaN
2  0.022225       NaN  0.278181
3 -0.701455       NaN  0.183635
4 -0.166722 -0.268487  1.642895
5  0.983667  0.161603 -0.854244
6  1.640509 -1.597101 -0.382677

In [104]:
# default로 행 기준(axis = 0)을 지정
df.dropna()

          0         1         2
4 -0.166722 -0.268487  1.642895
5  0.983667  0.161603 -0.854244
6  1.640509 -1.597101 -0.382677

#### dropna(thresh 값) : thresh = n / n개 이상의 정상값이 존재할 경우는 살려둠

In [108]:
# 기본으로 axis = 0의 가로줄이 기준이나, 
# 가로줄 기준으로 1개 이상의 정상 값이 있으면 살려두는
print(df.dropna(thresh = 1))
# 정상 값이 2개 이상이 있으면 살려둠
print(df.dropna(thresh = 2))
# how="all"은 3개 값이 모두 비정상일 때만 삭제(고정 된 메서드) thresh = 1과 같다.

          0         1         2
0  1.565406       NaN       NaN
1 -0.780808       NaN       NaN
2  0.022225       NaN  0.278181
3 -0.701455       NaN  0.183635
4 -0.166722 -0.268487  1.642895
5  0.983667  0.161603 -0.854244
6  1.640509 -1.597101 -0.382677
          0         1         2
2  0.022225       NaN  0.278181
3 -0.701455       NaN  0.183635
4 -0.166722 -0.268487  1.642895
5  0.983667  0.161603 -0.854244
6  1.640509 -1.597101 -0.382677

### fillna() : NaN을 다른 값으로 채우기

In [109]:
# 1개의 값으로 NaN을 채우기
df.fillna(1000)

          0            1            2
0  1.565406  1000.000000  1000.000000
1 -0.780808  1000.000000  1000.000000
2  0.022225  1000.000000     0.278181
3 -0.701455  1000.000000     0.183635
4 -0.166722    -0.268487     1.642895
5  0.983667     0.161603    -0.854244
6  1.640509    -1.597101    -0.382677

In [110]:
# 1컬럼에는 9999로 처리, 3컬럼에는 -9999로 처리
# 단, 3컬럼은 없으니 에러 및 경고 없이 처리가 되니 유의하자
df.fillna({1:9999, 3:-9999})

          0            1         2
0  1.565406  9999.000000       NaN
1 -0.780808  9999.000000       NaN
2  0.022225  9999.000000  0.278181
3 -0.701455  9999.000000  0.183635
4 -0.166722    -0.268487  1.642895
5  0.983667     0.161603 -0.854244
6  1.640509    -1.597101 -0.382677